---
kind: method
id: M:Autodesk.Revit.DB.Macros.ApplicationEntryPoint.Initialize(System.Object,System.String)
source: html/fef8dd39-abf8-f27e-3d32-86667aac8062.htm
---
# Autodesk.Revit.DB.Macros.ApplicationEntryPoint.Initialize Method

For Revit Macros internal use only.

## Syntax (C#)
```csharp
public void Initialize(
	Object obj,
	string addinFolder
)
```

## Parameters
- **obj** (`System.Object`)
- **addinFolder** (`System.String`)